{
  "data": {
    "lesson": {
      "id": 1016425,
      "key": "8bb442ca-5abb-4d52-afff-0b010dd05e1c",
      "title": "AWS Cloud Architect program introduction",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": null,
      "lesson_type": "Classroom",
      "display_workspace_project_only": null,
      "resources": null,
      "project": null,
      "lab": null,
      "concepts": [
        {
          "id": 1016426,
          "key": "42f15243-2e2a-47ac-b3c0-a54f02669749",
          "title": "Welcome to Udacity",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "42f15243-2e2a-47ac-b3c0-a54f02669749",
            "completed_at": "2020-05-18T19:13:54.684Z",
            "last_viewed_at": "2020-05-18T19:13:55.398Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1016427,
              "key": "7035e87d-9762-41c7-8d9a-b95c7b1637b3",
              "title": "Welcome To Udacity V2",
              "semantic_type": "VideoAtom",
              "is_public": true,
              "instructor_notes": "",
              "video": {
                "youtube_id": "9QadFJRKrEA",
                "china_cdn_id": "9QadFJRKrEA.mp4"
              }
            },
            {
              "id": 1016429,
              "key": "85f0945d-7f88-4f5f-9693-2e5eea57df94",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "Welcome to Udacity!\n\nI am Sebastian, the founder of Udacity.\n\nOur mission is to power careers through tech education. We’re honored that you’ve chosen us to help in your career journey. Whether embarking on a new path. Curious about a new field. Or advancing in your own field. I want you to know, you’re in the right place. We are here to help you accomplish your goals.\n\nI can’t wait to see where this journey takes you!\n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 1016430,
          "key": "c4132698-c675-4bc7-a535-e701005449d0",
          "title": "Welcome to the Nanodegree program experience",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "c4132698-c675-4bc7-a535-e701005449d0",
            "completed_at": "2020-05-18T19:14:41.599Z",
            "last_viewed_at": "2020-05-18T19:14:42.286Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1016431,
              "key": "47812d2d-78d8-4932-8d1d-1662ac9d42af",
              "title": "Welcome To Your Nanodegree Experience V2",
              "semantic_type": "VideoAtom",
              "is_public": true,
              "instructor_notes": "",
              "video": {
                "youtube_id": "gd0Z0S58Y68",
                "china_cdn_id": "gd0Z0S58Y68.mp4"
              }
            },
            {
              "id": 1016432,
              "key": "b615489c-5e03-44e4-8293-e12e67740214",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "If this is your first Nanodegree program, you start here\nIf you have taken a Nanodegree program with us before, you already know a little bit of what to expect. Udacity is always improving our learning experience for students. So you can watch this to see what is changed or skip ahead. You can also read this in the FAQ located in the resources tab.\n\nLet’s get started. \n\nWe truly believe you couldn’t have chosen a better place to learn. A lot of people have worked tirelessly to create the course material and platform features, as we all want you to get the most of your learning journey. Our pledge is to prov ide you with resources and services that will further enable you to succeed in your Nanodegree program. As you go through the lessons, you may find some to be difficult and may feel discouraged. If this happens, we encourage you to take advantage of your community channels and mentor services to help clarify the concepts, or just to share your doubts. Our mentors are there to help you! You will get advice and guidance to ensure you are on track to complete the projects. We WANT you to succeed and graduate with a Udacity Nanodegree certificate.\n\nWe value the trust you have put in us by making this investment in your future career. We take it seriously and we are here to help you achieve whatever you came here to accomplish.\n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 1016433,
          "key": "d1722b19-0f82-4107-af7e-b08239519f8b",
          "title": "Welcome to AWS Cloud Architect Nanodegree Program",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "d1722b19-0f82-4107-af7e-b08239519f8b",
            "completed_at": "2020-05-18T19:15:05.650Z",
            "last_viewed_at": "2020-05-18T19:15:06.335Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1018608,
              "key": "4fc51c07-f507-4205-90b6-06c16050426c",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "Welcome to the AWS Cloud Architect Nanodegree Program! Hi, my name is Alison Rodal and I am a Product Lead here at Udacity. The Udacity content team partnered with a great team of industry experts to put this program together, and we are thrilled to have you join us.\n\n\nWhy a program for AWS Cloud Architcture? 80% of organizations will migrate to cloud solutions by 2025, according to Gartner, and today in North America nearly 60% of organizations utilize public cloud services, according to Forrester’s cloud computing predictions. As organizations continue to adopt cloud solutions, their demand for professionals with the expertise to design, build and migrate applications to the cloud continues to grow. Cloud architects that have experience in designing AWS infrastructure will meet a critical need, with AWS commanding over a third of today’s public-cloud market share.\n\nIn this Nanodegree program, you will acquire the necessary skills to advance your career and become an AWS cloud architect through hands-on practice building reliable, secure, and scalable AWS infrastructure.\nYou’ll learn the critical role cloud architects play in the design and execution of an organization’s cloud computing infrastructure, and the important gap cloud architects bridge between business objectives and cloud solutions, by converting objectives into executable technical requirements that support the business. Cloud Architects work with cross-functional team members to design, plan, and deploy highly available, scalable, and secure cloud services, and we are excited to support you in this step in your career! \n\n\nThroughout the program interactive lesson content, exercises, and hands-on projects will let you apply and practice your new skills. You’ll learn how to to build highly available and recoverable solutions that apply to common use cases, and design for cost, performance, and scale in AWS using industry standard and open source tools.  You’ll also learn how to protect an organization’s data and other assets by implementing cloud security best practices and how to design a DevSecOps pipeline that ensures security practices are implemented early on. You will learn from AWS cloud architecture experts in the field who have designed infrastructure for organizations of various size and across industries with more than 25 years collective experience.\n\n\nEvery project you submit gets reviewed and our project reviewers will provide personalized feedback on how you can improve your work. \nThese projects will serve as a portfolio you can use to demonstrate your skills. After you complete the program, you will be ready to become an AWS Cloud Architect or bring these crucial skills to your current role. We are excited and honored that you are taking this step in your journey with us.\n\n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 1016434,
          "key": "a9d6910e-3e2c-44bd-b6d4-1109fa4ed828",
          "title": "Prerequisites",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "a9d6910e-3e2c-44bd-b6d4-1109fa4ed828",
            "completed_at": "2020-05-18T19:15:25.911Z",
            "last_viewed_at": "2020-05-18T19:15:26.637Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1018597,
              "key": "45d40006-bcc4-4643-ba49-26d4664e4680",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "#### Prerequisites\n\n\n\n\nPrior experience as a cloud architect is not required. You should, however, be comfortable with an Object-Oriented-Programming language like JavaScript, Java or Python, web application development and knowledge of HTML and CSS, and Command Line Interface. One to two years of experience building applications or managing cloud services in AWS will also help you to succeed in this course. ",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 1016435,
          "key": "f6911364-ba81-4e16-9030-8bdd750808f5",
          "title": "Meet your instructors",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "f6911364-ba81-4e16-9030-8bdd750808f5",
            "completed_at": "2020-05-18T19:15:56.235Z",
            "last_viewed_at": "2020-05-18T19:15:56.785Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1018477,
              "key": "440442b6-2b2b-474e-9966-2508acff7111",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Meet Your Instructors\nWe have a great group of instructors for each of the courses of the Nanodegree program. Each of them brings expertise from working in the field and experience teaching others. Below is a short bio of each instructor, and you'll learn more about them during the courses they teach.\n\n### Course 1: Design for Availability, Reliability, and Resiliency",
              "instructor_notes": ""
            },
            {
              "id": 1018478,
              "key": "33cd03df-1622-4293-8cad-85f9f9b5819a",
              "title": null,
              "semantic_type": "ImageAtom",
              "is_public": true,
              "url": "https://video.udacity-data.com/topher/2020/May/5eb09d7d_thomas-verbiscer-4/thomas-verbiscer-4.jpg",
              "non_google_url": "https://s3.cn-north-1.amazonaws.com.cn/u-img/33cd03df-1622-4293-8cad-85f9f9b5819a",
              "caption": "",
              "alt": "",
              "width": 266,
              "height": 332,
              "instructor_notes": null
            },
            {
              "id": 1018479,
              "key": "fa24106f-9f91-4b14-a0cb-771e7d987f7c",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "#### Tom Verbiscer, Director of Engineering at Current Media\n\n\nI am a coach and builder specializing in creating, running and advancing highly scalable, reliable and flexible platforms. I love creating amazing products and building great teams.  I am AWS Certified at the professional tier as both an AWS Solutions Architect, and DevOps Engineer.\n\n\n### Course 2: Design for Performance and Scalability",
              "instructor_notes": ""
            },
            {
              "id": 1018480,
              "key": "504e0c35-eb63-4365-969e-b92b4656bc8a",
              "title": null,
              "semantic_type": "ImageAtom",
              "is_public": true,
              "url": "https://video.udacity-data.com/topher/2020/May/5eb09e17_lmb-img/lmb-img.jpg",
              "non_google_url": "https://s3.cn-north-1.amazonaws.com.cn/u-img/504e0c35-eb63-4365-969e-b92b4656bc8a",
              "caption": "",
              "alt": "",
              "width": 266,
              "height": 332,
              "instructor_notes": null
            },
            {
              "id": 1018482,
              "key": "c77801e6-8aa5-4bbd-b63b-a4e304e93ae9",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "#### Leslie Bell, Technical Trainer, AWS Training and Certification Group\n\nLeslie Bell is a Senior Solutions Architect specializing in IT Governance and Disaster Recovery. She has worked in technology across a number of industries, from scientific research, chemical analysis, transportation, to insurance to cloud-based infrastructure, where she developed a passion for documentation, operational analysis and improvement, and cultural transformation. She lives in Chicago where she is a home chef, yoga instructor, and Saturday morning athlete. Leslie is currently a Technical Trainer with the AWS Training and Certification Group\n\n\n### Course 3: Design for Security",
              "instructor_notes": ""
            },
            {
              "id": 1018483,
              "key": "6b32db13-65a6-442f-8aff-19c2fc399afa",
              "title": null,
              "semantic_type": "ImageAtom",
              "is_public": true,
              "url": "https://video.udacity-data.com/topher/2020/May/5eb09e87_img-5053/img-5053.jpg",
              "non_google_url": "https://s3.cn-north-1.amazonaws.com.cn/u-img/6b32db13-65a6-442f-8aff-19c2fc399afa",
              "caption": "",
              "alt": "",
              "width": 266,
              "height": 332,
              "instructor_notes": null
            },
            {
              "id": 1018485,
              "key": "8a61b767-471f-4a78-9ae9-449f817ba687",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "#### Mehdi Rezvi, Senior Cloud Architect, NuEra Automotive Solutions\n\nMehdi is a senior cloud architect and consultant based out of the Chicago area. He loves helping companies large and small build, deploy, and run their applications in the cloud.\nMost recently, he has worked with companies such as 2ndWatch and GuidePoint Security implementing solutions focused on cloud security.\n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 1016436,
          "key": "9ce55e9c-5378-44e7-8d91-2a7cd0947294",
          "title": "How to succeed?",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "9ce55e9c-5378-44e7-8d91-2a7cd0947294",
            "completed_at": "2020-05-18T19:16:08.200Z",
            "last_viewed_at": "2020-05-18T19:16:08.699Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 1016437,
              "key": "50eaef32-c10f-4c72-a3bd-29768a685838",
              "title": "Welcome How To  Succeed FINAL",
              "semantic_type": "VideoAtom",
              "is_public": true,
              "instructor_notes": "",
              "video": {
                "youtube_id": "hVwUijsLKzw",
                "china_cdn_id": "hVwUijsLKzw.mp4"
              }
            }
          ]
        }
      ]
    }
  },
  "_deprecated": [
    {
      "name": "non_google_url",
      "reason": "(2016/8/18) Not sure, ask i18n team for reason"
    },
    {
      "name": "non_google_url",
      "reason": "(2016/8/18) Not sure, ask i18n team for reason"
    },
    {
      "name": "non_google_url",
      "reason": "(2016/8/18) Not sure, ask i18n team for reason"
    }
  ]
}