{
  "data": {
    "lesson": {
      "id": 918900,
      "key": "3be8f797-4648-43ff-8168-18b2a9a5176c",
      "title": "Identify Customer Segments",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": "In this project, you'll apply your unsupervised learning skills to two demographics datasets, to identify segments and clusters in the population, and see how customers of a company map to them.",
      "lesson_type": "Classroom",
      "display_workspace_project_only": false,
      "resources": {
        "files": [
          {
            "name": "Videos Zip File",
            "uri": "https://zips.udacity-data.com/3be8f797-4648-43ff-8168-18b2a9a5176c/918900/1581974008564/Identify+Customer+Segments+Videos.zip"
          },
          {
            "name": "Transcripts Zip File",
            "uri": "https://zips.udacity-data.com/3be8f797-4648-43ff-8168-18b2a9a5176c/918900/1581974005370/Identify+Customer+Segments+Subtitles.zip"
          }
        ],
        "google_plus_link": null,
        "career_resource_center_link": null,
        "coaching_appointments_link": null,
        "office_hours_link": null,
        "aws_provisioning_link": null
      },
      "project": {
        "key": "83a65914-fe3e-498a-a2f5-9147e5a0f2b4",
        "version": "1.0.0",
        "locale": "en-us",
        "duration": 40320,
        "semantic_type": "Project",
        "title": "Creating Customer Segments with Arvato",
        "description": "The data and design for this project were provided by Arvato Financial Services. You will apply unsupervised learning techniques on demographic and spending data for a sample of German households. You will preprocess the data, apply dimensionality reduction techniques, and implement clustering algorithms to segment customers with the goal of optimizing customer outreach for a mail order company.\n\n## Evaluation\n\nUse the instructions in the project lesson to complete all steps in the project. Once you're done, review your work against the [project rubric](http://review.udacity.com/#!/projects/f5062c28-1399-403e-af18-0e5b0e4587fd/rubric). Check that all of your work and its documentation meets specifications on all rubric points – if you see room for improvement in **any** category for which you do not meet specifications, go back and make some revisions. Remember that your project will be evaluated by a Udacity reviewer, and it must meet specifications on **all** rubric points in order for the submission to pass.\n\n## Submission\n\nOnce you are ready to submit your project, collect the following files in a .zip archive:\n1. A copy of the `Identify_Customer_Segments.ipynb` notebook with completed code cells and filled out Discussion sections. If you worked on the project from the workspace in the lesson, you can download a copy of the notebook by going to the workspace and navigating to the **File -> Download as -> Notebook (.ipynb)** option.\n2. An HTML export of the above project notebook. This can be obtained by navigating to **File -> Download as -> HTML (.html)** in the notebook editor.\n\n## Ready to submit your project?\n\nIf you've checked your project against the [rubric](http://review.udacity.com/#!/projects/f5062c28-1399-403e-af18-0e5b0e4587fd/rubric) and placed both the notebook and html export into a .zip file, you can click on the \"Submit Project\" button below and follow the instructions to submit your project. You'll get an e-mail once your reviewer has completed their feedback; this can take up to a week but in most cases will be much faster than this.",
        "is_public": true,
        "summary": null,
        "forum_path": "",
        "rubric_id": "2538",
        "terminal_project_id": null,
        "resources": null,
        "image": null
      },
      "lab": null,
      "concepts": [
        {
          "id": 637752,
          "key": "e5c0ea51-022f-4c89-ab98-87f7ac760991",
          "title": "Project Introduction",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "e5c0ea51-022f-4c89-ab98-87f7ac760991",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 644534,
              "key": "6be14c3b-5499-4596-b622-ed88fe17087c",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Project Introduction\n\nWelcome to the project for this part of the Nanodegree program. Now that you’ve learned about unsupervised learning techniques that allow you to summarize the dimensions of your data and cluster unlabeled data into groups with similar properties, it’s time to apply your knowledge to some real-life data.\n\n\nIn this project, our Bertelsmann partners AZ Direct and Arvato Financial Solutions have provided two datasets one with demographic information about the people of Germany, and one with that same information for customers of a mail-order sales company. You’ll look at relationships between demographics features, organize the population into clusters, and see how prevalent customers are in each of the segments obtained.\n\nBefore you begin, Timo will provide some background about the dataset, how it was prepared, and the tasks performed by a data scientist using this data.",
              "instructor_notes": ""
            },
            {
              "id": 637753,
              "key": "601e005e-a74f-4597-96af-cd549bba1267",
              "title": "Creating Customer Segmentation Arvato Project",
              "semantic_type": "VideoAtom",
              "is_public": true,
              "instructor_notes": "",
              "video": {
                "youtube_id": "VCChvqoK6Go",
                "china_cdn_id": "VCChvqoK6Go.mp4"
              }
            },
            {
              "id": 644535,
              "key": "c6c1fd6e-f562-4f66-9a27-006ed71c05d9",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "We hope you’re excited to test your skills on some real-life data. Don’t forget that you’ll need to make use of more than what was covered in the preceding course. You’ll need to use wrangling techniques to organize the data into a form you can work with, and you’ll need to interpret the output of your operations.\n\nThe remainder of this lesson will provide you instructions for completing the project, and a rubric detailing how the project will be evaluated. Rise up to the challenge, and let’s see what patterns you can find in the data!",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 644536,
          "key": "e6f18cbb-5978-4e12-89fe-aaf2c2fe4975",
          "title": "Project Overview",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "e6f18cbb-5978-4e12-89fe-aaf2c2fe4975",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 644537,
              "key": "dc36b3c0-ab87-4edf-9ea1-3f1b60d9035a",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Project Overview \n\nIn this project, you will work with real-life data provided to us by our Bertelsmann partners AZ Direct and Arvato Finance Solution. The data here concerns a company that performs mail-order sales in Germany. Their main question of interest is to identify facets of the population that are most likely to be purchasers of their products for a mailout campaign. Your job as a data scientist will be to use unsupervised learning techniques to organize the general population into clusters, then use those clusters to see which of them comprise the main user base for the company. Prior to applying the machine learning methods, you will also need to assess and clean the data in order to convert the data into a usable form.\n\n## What will I need to install?\n\nIt is highly recommended that you use the project workspace to complete and submit this project.  Should you decide to download the data, you will need to remove it from your computer via the agreement with Arvato Bertlesmann.  If you choose to use your machine to complete this project, below are a list of the requirements.\n\nThis project uses Python 3 and is designed to be completed through the Jupyter Notebooks IDE. It is highly recommended that you use the Anaconda distribution to install Python, since the distribution includes all necessary Python libraries as well as Jupyter Notebooks. The following libraries are expected to be used in this project:\n\n- **NumPy**\n- **pandas**\n- **Sklearn** / scikit-learn\n- **Matplotlib** (for data visualization)\n- **Seaborn** (for data visualization)\n\n## Why this project?\n\nThe unsupervised learning branch of machine learning is key in the organization of large and complex datasets. While unsupervised learning lies in contrast to supervised learning in the fact that unsupervised learning lacks objective output classes or values, it can still be important in converting the data into a form that can be used in a supervised learning task. Dimensionality reduction techniques can help surface the main signals and associations in your data, providing supervised learning techniques a more focused set of features upon which to apply their work. Clustering techniques are useful for understanding how the data points themselves are organized. These clusters might themselves be a useful feature in a directed supervised learning task. This project will give you hands-on experience with a real-life task that makes use of these techniques, focusing on the unsupervised work that goes into understanding a dataset.\n\nIn addition, the dataset presented in this project requires a number of assessment and cleaning steps before you can apply your machine learning methods. In workplace contexts, you will frequently need to work with data that is untidy or needs preprocessing before standard algorithms and models can be applied. The ability to perform data wrangling and the ability to make decisions on data that you work with are both valuable skills that you will practice in this project.",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 644538,
          "key": "f3eb0b55-fb19-4271-955d-86f6e79eaef2",
          "title": "Project Details",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "f3eb0b55-fb19-4271-955d-86f6e79eaef2",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 644539,
              "key": "6543245e-8bf7-4a8b-9412-43981ae17d84",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Project Details\n\nBelow, you will find an outline of the steps that you will take in this project. It is recommended that you read through all of these instructions before starting on the project so you can build a high-level understanding of the tasks ahead!\n\n### Step 0: The Data\n\nThere are a number of files used for this project available in the workspace on the next page.  **It is strongly recommended that you complete and turn in this project from the workspace.**  As you will see from the agreement on the next page, if you choose to download a .zip file you will need to **REMOVE** the files from your computer via the agreement with Arvato Bartlesmann after completing the project, as the data are proprietary.  The files available for the project are:\n\n- `Udacity_AZDIAS_Subset.csv`: Demographic data for the general population of Germany; 891211 persons (rows) x 85 features (columns).\n- `Udacity_CUSTOMERS_Subset.csv`: Demographic data for customers of a mail-order company; 191652 persons (rows) x 85 features (columns).\n- `Data_Dictionary.md`: Information file about the features in the provided datasets.\n- `AZDIAS_Feature_Summary.csv`: Summary of feature attributes for demographic data.\n- `Identify_Customer_Segments.ipynb`: Jupyter Notebook divided into sections and guidelines for completing the project. The notebook provides more details and tips than the outline given here.\n\nAfter downloading the data and unzipping it to a working folder of your choice, use the Terminal or Command Prompt to navigate to your selected folder and execute the command `jupyter notebook Identify_Customer_Segments.ipynb` to open up a browser window or tab to work on the project notebook.\n\n### Step 1: Preprocessing\n\nWhen you start an analysis, you must first explore and understand the data that you are working with. In this (and the next) step of the project, you’ll be working with the general demographics data. As part of your investigation of dataset properties, you must attend to a few key points:\n\n- How are missing or unknown values encoded in the data? Are there certain features (columns) that should be removed from the analysis because of missing data? Are there certain data points (rows) that should be treated separately from the rest?\n- Consider the level of measurement for each feature in the dataset (e.g. categorical, ordinal, numeric). What assumptions must be made in order to use each feature in the final analysis? Are there features that need to be re-encoded before they can be used? Are there additional features that can be dropped at this stage?\n\nYou will create a cleaning procedure that you will apply first to the general demographic data, then later to the customers data.\n\n### Step 2: Feature Transformation\n\nNow that your data is clean, you will use dimensionality reduction techniques to identify relationships between variables in the dataset, resulting in the creation of a new set of variables that account for those correlations. In this stage of the project, you will attend to the following points:\n\n- The first technique that you should perform on your data is feature scaling. What might happen if we don’t perform feature scaling before applying later techniques you’ll be using?\n- Once you’ve scaled your features, you can then apply principal component analysis (PCA) to find the vectors of maximal variability. How much variability in the data does each principal component capture? Can you interpret associations between original features in your dataset based on the weights given on the strongest components? How many components will you keep as part of the dimensionality reduction process?\n\nYou will use the **sklearn** library to create objects that implement your feature scaling and PCA dimensionality reduction decisions.\n\n### Step 3: Clustering\n\nFinally, on your transformed data, you will apply clustering techniques to identify groups in the general demographic data. You will then apply the same clustering model to the customers dataset to see how market segments differ between the general population and the mail-order sales company. You will tackle the following points in this stage:\n\n- Use the k-means method to cluster the demographic data into groups. How should you make a decision on how many clusters to use?\n- Apply the techniques and models that you fit on the demographic data to the customers data: data cleaning, feature scaling, PCA, and k-means clustering. Compare the distribution of people by cluster for the customer data to that of the general population. Can you say anything about which types of people are likely consumers for the mail-order sales company?\n\n**sklearn** will continue to be used in this part of the project, to perform your k-means clustering. In the end, you will export the completed notebook with your work as an HTML file, which will serve as a report documenting your approach and findings.\n\n### Step 4: Review and Submit the Project\n\nBefore you submit your project for review, you should first review the [project rubric](http://review.udacity.com/#!/projects/f5062c28-1399-403e-af18-0e5b0e4587fd/rubric). Your project will be evaluated by an Udacity reviewer using this criteria, so you should make a self-evaluation as well. In order for your project to pass review, it must meet all specifications.\n\nOnce you are ready for project submission, export an HTML version of your notebook and add to your workspace submission, then submit your entire project from the workspace using in the button in the bottom right.",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 671788,
          "key": "bea4372b-5c40-4030-b324-9b2c291e55ae",
          "title": "Arvato: Terms and Conditions",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "bea4372b-5c40-4030-b324-9b2c291e55ae",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 671790,
              "key": "a3c13ab9-3188-4c41-ad00-9b74080194f1",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "### Terms & Conditions\n\nIn addition to Udacity's Terms of Use and other policies, your\ndownloading and use of the **AZ Direct GmbH** data solely for use in the\n**Unsupervised Learning** and **Bertelsmann Capstone** projects are\ngoverned by the following additional terms and conditions. The big takeaways:\n\n1. You agree\nto **AZ Direct GmbH's** General Terms provided below and that you only\nhave the right to download and use the **AZ Direct GmbH** data solely to\ncomplete the data mining task which is part of the **Unsupervised\nLearning** and **Bertelsmann Capstone** projects for the Udacity Data\nScience Nanodegree program. \n\n2. You are prohibited from using the **AZ\nDirect GmbH** data in any other context. \n\n3. You are also required and\nhereby represent and warrant that you will delete any and all data you\ndownloaded within 2 weeks after your completion of the **Unsupervised\nLearning** and **Bertelsmann Capstone** projects and the program. \n4. If you\ndo not agree to these additional terms, you will not be allowed to\naccess the data for this project.\n\nThe full terms are provided in the workspace below.  You will then be asked in the next workspace to agree to these terms before gaining access to the project, which you may also choose to download if you would like to read in full the terms.\n\nThese same exact terms are provided in the next workspace, where you will be asked to accept the terms prior to gaining access to the data.",
              "instructor_notes": ""
            },
            {
              "id": 671792,
              "key": "265d09c1-437c-4961-b6d6-980e8bbbea18",
              "title": null,
              "semantic_type": "WorkspaceAtom",
              "is_public": true,
              "workspace_id": "viewBkemTRVpM7",
              "pool_id": "jupyter",
              "view_id": "jupyter-rJ7a0E6fX",
              "gpu_capable": false,
              "configuration": {
                "id": "reserved",
                "blueprint": {
                  "conf": {
                    "disk": null,
                    "ports": [],
                    "allowGrade": false,
                    "allowSubmit": false,
                    "defaultPath": ""
                  },
                  "kind": "jupyter"
                },
                "workspaceId": "reserved"
              },
              "starter_files": null
            }
          ]
        },
        {
          "id": 671777,
          "key": "f8042ef2-b4d5-4690-9eac-c92fb9fd8824",
          "title": "Project Workspace",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "f8042ef2-b4d5-4690-9eac-c92fb9fd8824",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 671780,
              "key": "b119b2c5-58ac-4c95-ad06-5c9efde9ef64",
              "title": null,
              "semantic_type": "WorkspaceAtom",
              "is_public": true,
              "workspace_id": "viewrygazrVTGQ",
              "pool_id": "jupyter",
              "view_id": "jupyter-B16fBNpGX",
              "gpu_capable": false,
              "configuration": {
                "id": "reserved",
                "blueprint": {
                  "conf": {
                    "disk": null,
                    "ports": [],
                    "allowGrade": false,
                    "allowSubmit": false,
                    "defaultPath": "/notebooks/Identify_Customer_Segments.ipynb"
                  },
                  "kind": "jupyter"
                },
                "workspaceId": "reserved"
              },
              "starter_files": null
            }
          ]
        }
      ]
    }
  }
}