{
  "data": {
    "lesson": {
      "id": 844044,
      "key": "16cdc5e9-c4b1-4740-b048-59df5edfcbe4",
      "title": "Machine Learning Capstone",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": null,
      "lesson_type": "Classroom",
      "display_workspace_project_only": null,
      "resources": null,
      "project": {
        "key": "56f56b79-4301-462d-bd41-716e895ff03d",
        "version": "1.0.0",
        "locale": "en-us",
        "duration": 40320,
        "semantic_type": "Project",
        "title": "Capstone Project",
        "description": "In this capstone project, you will leverage what you’ve learned throughout the Nanodegree program to solve a problem of your choice by applying machine learning algorithms and techniques. You will first **define** the problem you want to solve and investigate potential solutions and performance metrics. Next, you will **analyze** the problem through visualizations and data exploration to have a better understanding of what algorithms and features are appropriate for solving it. You will then **implement** your algorithms and metrics of choice, documenting the preprocessing, refinement, and postprocessing steps along the way. Afterward, you will collect **results** about the performance of the models used, visualize significant quantities, and validate/justify these values. Finally, you will construct **conclusions** about your results, and discuss whether your implementation adequately solves the problem.\n\nThink about a technical field or domain that you are passionate about, such as robotics, virtual reality, finance, natural language processing, or even artificial intelligence (the possibilities are endless!). Then, choose an existing problem within that domain that you are interested in which you could solve by applying machine learning algorithms and techniques. Be sure that you have collected all of the resources needed (such as data sets) to complete this project, and make the appropriate citations wherever necessary in your report. \n\nIn addition, you may find a technical domain (along with the problem and dataset) as *competitions* on platforms such as [Kaggle](http://kaggle.com), or [Devpost](http://devpost.com). This can be helpful for discovering a particular problem you may be interested in solving as an alternative to the suggested problem areas above. In many cases, some of the requirements for the capstone project are already defined for you when choosing from these platforms. \n\nFor whichever application area or problem you ultimately investigate, there are five major stages to this capstone project which you will move through and subsequently document. Each stage plays a significant role in the development life cycle of beginning with a problem definition and finishing with a polished, working solution. As you make your way through developing your project, be sure that you are also working on a rough draft of your project report, as it is the most important aspect to your submission! \n\n### Evaluation\nYour project will be reviewed by a Udacity reviewer against the **<a href=\"https://review.udacity.com/#!/rubrics/2541/view\" target=\"_blank\">Machine Learning Capstone project rubric</a>**. Be sure to review this rubric thoroughly and self-evaluate your project before submission. All criteria found in the rubric must be *meeting specifications* for you to pass.\n\n### Submission Files\nAt a minimum, your submission will be required to have the following files listed below. If your submission method of choice is uploading an archive (`*.zip`), please take into consideration the total file size. You will need to include\n- Your **capstone proposal** document as **proposal.pdf** if you have completed the pre-requisite *Capstone Proposal* project. Please also include your review link in the *student submission* notes.\n- A project report (**in PDF format only**) addressing the five major project development stages. The recommended page length for a project report is approximately *nine to fifteen pages*. **Please do not export an iPython Notebook as PDF for your project report**.\n- All development Python code used for your project that is required to reproduce your implemented solution and result. Your code should be in a *neat and well-documented format*. Using iPython Notebooks is strongly encouraged for development.\n- A `README` documentation file which briefly describes the software and libraries used in your project, including any necessary references to supporting material. If your project requires setup/startup, ensure that your `README` includes the necessary instructions.\n- Any additional supporting material such as datasets, images, or input files that are necessary for your project's development and implementation. If these files are too large and you are uploading your submission, **instead provide appropriate means of acquiring the necessary files in your included** `README`.\n\n### I'm Ready!\nWhen you're ready to submit your project, click on the **Submit Project** button at the bottom of this page.\n\nIf you are having any problems submitting your project or wish to check on the status of your submission, please email us at **machine-support@udacity.com** or visit us in the <a href=\"http://discussions.udacity.com\" target=\"_blank\">discussion forums</a>.\n\n### What's Next?\nYou will get an email as soon as your reviewer has feedback for you. In the meantime, review your next project and feel free to get started on it or the courses supporting it!",
        "is_public": true,
        "summary": null,
        "forum_path": "c/nd009-capstone",
        "rubric_id": "2541",
        "terminal_project_id": null,
        "resources": null,
        "image": null
      },
      "lab": null,
      "concepts": [
        {
          "id": 858983,
          "key": "7edf7cb8-2a41-4997-8635-e51198aaa5b7",
          "title": "Capstone project",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "7edf7cb8-2a41-4997-8635-e51198aaa5b7",
            "completed_at": "2020-01-01T07:31:44.690Z",
            "last_viewed_at": "2020-01-18T12:20:15.396Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 858984,
              "key": "bc7795dc-3eff-4a33-867f-4ce128ed631e",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "Welcome to the capstone project. Continue to the project submission page to get more information.",
              "instructor_notes": ""
            }
          ]
        }
      ]
    }
  }
}