{
  "data": {
    "lesson": {
      "id": 18264,
      "key": "4695712300",
      "title": "Final Steps",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": "Finish up and get ready to graduate!",
      "lesson_type": "Classroom",
      "display_workspace_project_only": null,
      "resources": {
        "files": [],
        "google_plus_link": null,
        "career_resource_center_link": null,
        "coaching_appointments_link": null,
        "office_hours_link": null,
        "aws_provisioning_link": null
      },
      "project": null,
      "lab": null,
      "concepts": [
        {
          "id": 56373,
          "key": "49172588780923",
          "title": "Graduation",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "49172588780923",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 35309,
              "key": "4917258878",
              "title": "Graduation",
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Graduation\n\nOnce all your projects have Met or Exceeded Specifications, you'll see a special screen with a button to get started with the graduation process.  The button will send you an email with instructions to verify your ID, complete a Final Reflection, and possibly schedule an exit interview.  After we've verified your completion of the required steps, we will graduate you from the Nanodegree.  Congratulations!\n\n***If you are having any troubles going through this process or if you have any questions, please email us at graduation-support@udacity.com.***\n\n## Identification Verification\nYour email will contain a special link to verify your identity. You also may be asked to participate in a scheduled exit interview.\n\nFor the identification process you will need a valid ID (i.e. Drivers license, government issued ID, or Passport) and access to a webcam or digital scanner. For a full list of supported countries and ID's please be sure check [here](https://www.jumio.com/netverify/supported-countries/). If you do not see your country or ID type on this list please contact graduation-support@udacity.com.\n\n## Exit Interviews\nIf you are selected for an interview, we will be asking you technical questions to verify your understanding of the material as a whole. It would be helpful to review the knowledge learned from your projects, but additional preparation is not necessary. Expect the interview to take about half an hour.\n\n## Final Reflection\nThe email will also contain a link to a Final Reflection. This is an opportunity to reflect back on all the things you have learned and prepare you for the next stage in getting a job or the promotion that you've earned.\n\n",
              "instructor_notes": ""
            }
          ]
        }
      ]
    }
  }
}