{
  "data": {
    "lesson": {
      "id": 781557,
      "key": "4f0118c0-20fc-482a-81d6-b27507355985",
      "title": "Machine Learning Engineer Capstone Project",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": "Put your Machine Learning Engineer skills to the test by solving a real-world problem using all that you have learned throughout the program.",
      "lesson_type": "Classroom",
      "display_workspace_project_only": false,
      "resources": {
        "files": [
          {
            "name": "Videos Zip File",
            "uri": "https://zips.udacity-data.com/4f0118c0-20fc-482a-81d6-b27507355985/781557/1544197363160/Machine+Learning+Engineer+Capstone+Project+Videos.zip"
          },
          {
            "name": "Transcripts Zip File",
            "uri": "https://zips.udacity-data.com/4f0118c0-20fc-482a-81d6-b27507355985/781557/1544197360510/Machine+Learning+Engineer+Capstone+Project+Subtitles.zip"
          }
        ],
        "google_plus_link": null,
        "career_resource_center_link": null,
        "coaching_appointments_link": null,
        "office_hours_link": null,
        "aws_provisioning_link": null
      },
      "project": null,
      "lab": null,
      "concepts": [
        {
          "id": 781576,
          "key": "c54bd868-4638-4f17-b85c-53a88c33b6a8",
          "title": "Project Overview",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "c54bd868-4638-4f17-b85c-53a88c33b6a8",
            "completed_at": "2019-12-05T14:57:37.120Z",
            "last_viewed_at": "2019-12-06T07:34:25.344Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 781578,
              "key": "23dc54e9-a1d4-4811-b2a0-bdd3547b0f0c",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "### Build Your Machine Learning Project\n\nIn this capstone project, you will leverage what you’ve learned throughout the program to build a machine learning engineer project of your choosing. Your project deliverables are:\n\n1. A Github repository of your work.\n2. A blog post written for a technical audience, or a deployed web application powered by data.\n\nIn this capstone project, you will leverage what you’ve learned throughout the Nanodegree program to solve a problem of your choice. \n\n1. You will first **define** the problem you want to solve and investigate potential solutions. \n2. Next, you will **analyze** the problem through visualizations and data exploration to have a better understanding of what algorithms and features are appropriate for solving it. \n3. You will then **implement** your algorithms and metrics of choice, documenting the preprocessing, refinement, and post-processing steps along the way. \n4. Afterwards, you will collect **results** about your findings, visualize significant quantities, validate/justify your results, and make any concluding remarks about whether your implementation adequately solves the problem. \n5. Finally, you will **construct** a blog post to document all of the steps from start to finish of your project, or deploy your results into a web application.\n\n### Setting Yourself Apart\nAn important part of landing a job or advancing your career as a machine learning engineer is setting yourself apart through impressive projects. By now, you've completed several guided projects, and now's your chance to show off your skills and creativity. You'll receive a review and feedback from a Udacity mentor, and they will focus on how your project demonstrates your skills.\n\nThis project is designed to prepare you for delivering a polished, end-to-end solution report of a real-world problem in a field of interest. When developing new technology, or deriving adaptations of previous technology, properly documenting your process is critical for both validating and replicating your results.\n\nThings you will learn by completing this project:\n- How to research and investigate a real-world problem of interest.\n- How to accurately apply specific data science algorithms and techniques.\n- How to properly analyze and visualize your data and results for validity.\n- How to document and write a report of your work.\n\n\n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 781582,
          "key": "46ba64e0-872d-45d9-9f4f-516181360b67",
          "title": "Software & Data Requirements",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "46ba64e0-872d-45d9-9f4f-516181360b67",
            "completed_at": "2019-12-06T07:55:39.437Z",
            "last_viewed_at": "2019-12-06T07:55:38.410Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 781590,
              "key": "e8501e96-5eb0-454c-b418-1f8203178a96",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Software Requirements\n**Your project must be written in Python 3.x**. Given the free-form nature of the capstone, the software and libraries you will need to successfully complete your work will vary depending on the chosen application area and problem definition. Because of this, it is imperative that all necessary software and libraries used in your capstone project are accessible to the reviewer and clearly documented. Information regarding the software and libraries your project makes use of should be included in the `README` along with your submission. Please note that proprietary software, software that requires private licenses, or software behind a paywall or login account should be avoided.\n\n## Data Requirements\nEvery capstone project will most certainly require some form of dataset or input data structure (input text files, images, etc.). Similar to the software requirements above, the data you use must either be publicly accessible or provided by you during the submission process, and private or proprietary data should not be used without expressed permission. Please take into consideration the file size of your data — while there is no strict upper limit, input files that are excessively large may require reviewers longer than an acceptable amount of time to acquire all of your project files and/or execute the provided development code. This can take away from the reviewer's time that could be put towards evaluating your submission. If the data you are working with fits the criteria of being too large, consider whether you can work with a subset of the data instead, or provide a representative sample of the data which the reviewer may use to verify the solution explored in the project.\n\n## Ethics\nUdacity's A/B Testing course has a segment that discusses [the sensitivity of data](https://classroom.udacity.com/courses/ud257/lessons/3998098714/concepts/39997087540923#) (free course link) and the expectation of privacy from those whose information has been collected. While most data you find available to the public will not have any ethical complications, it is extremely important that you are considering where the data you are using came from, and whether that data contains any sensitive information. For example, if you worked for a bank and wanted to use customers' bank statements as part of your project, this would most likely be an unethical choice of data and should be avoided.\n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 781676,
          "key": "083a5859-22b3-4c90-acc2-26c4450d8f46",
          "title": "Possible Projects",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "083a5859-22b3-4c90-acc2-26c4450d8f46",
            "completed_at": "2019-12-06T07:56:07.364Z",
            "last_viewed_at": "2020-01-17T14:25:04.731Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 781688,
              "key": "6e76b968-a46c-42b4-aa39-0afd7d8998a9",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "### Selecting a Project\n\nThink about a technical field or domain that you are passionate about, such as robotics, virtual reality, finance, natural language processing, or even artificial intelligence (the possibilities are endless!). Then, choose an existing problem within that domain that you are interested in which you could solve by applying machine learning techniques. Be sure that you have collected all of the resources needed (such as data sets) to complete this project, and make the appropriate citations wherever necessary in Github (and your blog if that is the path you decide to pursue). Below are a few suggested problem areas you could explore if you are unsure what your passion is:\n\n- [Robot Motion Planning](https://docs.google.com/document/d/1ZFCH6jS3A5At7_v5IUM5OpAXJYiutFuSIjTzV_E-vdE/pub)\n- [Healthcare](https://docs.google.com/document/d/e/2PACX-1vT_MjTWMs1-668wgKALIK61AUHbqbKhp4UuUvYK99u0vc_R0K68Cqq5Br0Nf0aoGmg8XVAyfjd1MT8s/pub)\n- [Computer Vision](https://docs.google.com/document/d/1y-XfjkPFgUQxFIQ9bBncUSjs4HOf5E-45FrLYNBsZb4/pub)\n- [Education](https://docs.google.com/document/d/1vjerjRQnWs1kLbZagDYT6rNqiwAG23Yj45oUY88IAxI/pub)\n- [Investment and Trading](https://docs.google.com/document/d/1ycGeb1QYKATG6jvz74SAMqxrlek9Ed4RYrzWNhWS-0Q/pub)\n\nIn addition, you may find a technical domain (along with the problem and dataset) as *competitions* on platforms such as [Kaggle](http://kaggle.com), or [Devpost](http://devpost.com). This can be helpful for discovering a particular problem you may be interested in solving as an alternative to the suggested problem areas above. In many cases, some of the requirements for the capstone project are already defined for you when choosing from these platforms. \n\n#### Udacity Specific Projects\n\n * **Customer Segmentation Report for Arvato Financial Services** <br>*(Note: High performers on this project have the opportunity to be funneled directly into the talent pipeline for Bertelsmann. Read more on the next page.)*\n\n\n * **Optimizing App Offers With Starbucks** <br>*(Note: High performers on this project have the opportunity to be funneled directly into the talent pipeline for Starbucks. Read more on the Starbuck's Project Overview Page.)*\n\n* **Use Convolutional Neural Networks to Identify Dog Breeds** <br>*(If you decide to do complete this project, you can find additional content to assist in the extra-curricular portion of this program)*.\n\n\n#### Check out Sample Projects\n\n* Here are two projects that can give you an idea of what a final blog post might look like. Each of these meets the requirements for the capstone project: [project 1](https://github.com/udacity/machine-learning/blob/master/projects/capstone/report-example-1.pdf) and [project 2](https://github.com/udacity/machine-learning/blob/master/projects/capstone/report-example-3.pdf).\n\nNo matter what project you decide to complete, you will want to make sure to check the [project rubric here](https://review.udacity.com/#!/rubrics/2345/view).  \n\n\n",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 722568,
          "key": "8400bad9-69b4-4455-826c-177d90752f00",
          "title": "Bertelsmann/Arvato Project Overview",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "8400bad9-69b4-4455-826c-177d90752f00",
            "completed_at": "2019-12-06T08:32:45.958Z",
            "last_viewed_at": "2019-12-06T08:32:44.626Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 769537,
              "key": "45e4f50a-f776-4190-95b9-4ced442b86d2",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Create a Customer Segmentation Report for Arvato Financial Solutions\n\nTo introduce yourself to the scenario you'll be investigating in this capstone project option, take a look at the following video with Timo Reis from Arvato Financial Solutions.",
              "instructor_notes": ""
            },
            {
              "id": 737646,
              "key": "6a23b819-bc51-4ad4-8deb-b5bd9288d642",
              "title": "Arvato Final Project",
              "semantic_type": "VideoAtom",
              "is_public": true,
              "instructor_notes": "",
              "video": {
                "youtube_id": "qBR6A0IQXEE",
                "china_cdn_id": "qBR6A0IQXEE.mp4"
              }
            },
            {
              "id": 722579,
              "key": "a44f05c3-7be2-4981-bce0-c7c62455b060",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Hiring Opportunity\nThe data and outline of this project was provided by Arvato Financial Solutions, a Bertelsmann subsidiary. High performers on this project will have their Udacity profile sent directly to Arvato for review, and may lead to an interview at either Arvato or Bertelsmann. This is a tremendous opportunity to get access to a data science hiring manager!\n\n## Steps to Complete This Project\nThe project has three major steps: the customer segmentation report, the supervised learning model, and the Kaggle Competition.\n\n#### 1. Customer Segmentation Report\nThis section will be similar to the corresponding project in Term 1 of the program, but the datasets now include more features that you can potentially use. You'll begin the project by using unsupervised learning methods to analyze attributes of established customers and the general population in order to create customer segments.\n\n#### 2. Supervised Learning Model\nYou'll have access to a third dataset with attributes from targets of a mail order campaign. You'll use the previous analysis to build a machine learning model that predicts whether or not each individual will respond to the campaign.\n\n#### 3. Kaggle Competition\nOnce you've chosen a model, you'll use it to make predictions on the campaign data as part of a Kaggle Competition. You'll rank the individuals by how likely they are to convert to being a customer, and see how your modeling skills measure up against your fellow students.",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 671788,
          "key": "bea4372b-5c40-4030-b324-9b2c291e55ae",
          "title": "Arvato: Terms and Conditions",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "bea4372b-5c40-4030-b324-9b2c291e55ae",
            "completed_at": "2020-01-17T14:25:09.652Z",
            "last_viewed_at": "2020-01-17T14:25:07.977Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 671790,
              "key": "a3c13ab9-3188-4c41-ad00-9b74080194f1",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "### Terms & Conditions\n\nIn addition to Udacity's Terms of Use and other policies, your\ndownloading and use of the **AZ Direct GmbH** data solely for use in the\n**Unsupervised Learning** and **Bertelsmann Capstone** projects are\ngoverned by the following additional terms and conditions. The big takeaways:\n\n1. You agree\nto **AZ Direct GmbH's** General Terms provided below and that you only\nhave the right to download and use the **AZ Direct GmbH** data solely to\ncomplete the data mining task which is part of the **Unsupervised\nLearning** and **Bertelsmann Capstone** projects for the Udacity Data\nScience Nanodegree program. \n\n2. You are prohibited from using the **AZ\nDirect GmbH** data in any other context. \n\n3. You are also required and\nhereby represent and warrant that you will delete any and all data you\ndownloaded within 2 weeks after your completion of the **Unsupervised\nLearning** and **Bertelsmann Capstone** projects and the program. \n4. If you\ndo not agree to these additional terms, you will not be allowed to\naccess the data for this project.\n\nThe full terms are provided in the workspace below.  You will then be asked in the next workspace to agree to these terms before gaining access to the project, which you may also choose to download if you would like to read in full the terms.\n\nThese same exact terms are provided in the next workspace, where you will be asked to accept the terms prior to gaining access to the data.",
              "instructor_notes": ""
            },
            {
              "id": 671792,
              "key": "265d09c1-437c-4961-b6d6-980e8bbbea18",
              "title": null,
              "semantic_type": "WorkspaceAtom",
              "is_public": true,
              "workspace_id": "viewBkemTRVpM7",
              "pool_id": "jupyter",
              "view_id": "jupyter-rJ7a0E6fX",
              "gpu_capable": false,
              "configuration": {
                "id": "reserved",
                "blueprint": {
                  "conf": {
                    "disk": null,
                    "ports": [],
                    "allowGrade": false,
                    "allowSubmit": false,
                    "defaultPath": ""
                  },
                  "kind": "jupyter"
                },
                "workspaceId": "reserved"
              },
              "starter_files": null
            }
          ]
        },
        {
          "id": 751856,
          "key": "e9553619-113b-4565-a34e-a9ef450659de",
          "title": "Bertelsmann/Arvato Project Workspace",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "e9553619-113b-4565-a34e-a9ef450659de",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 759885,
              "key": "fc29f5bf-c7c3-4a9e-bc3e-4d5f3c3ce60a",
              "title": null,
              "semantic_type": "WorkspaceAtom",
              "is_public": true,
              "workspace_id": "viewqk2nn0jlef",
              "pool_id": "jupyter",
              "view_id": "jupyter-bwokrwvgyrr",
              "gpu_capable": false,
              "configuration": {
                "id": "reserved",
                "blueprint": {
                  "conf": {
                    "disk": {
                      "id": "data-science-datasets",
                      "paths": [
                        {
                          "src": "/",
                          "dest": "/data/"
                        }
                      ]
                    },
                    "ports": [],
                    "allowGrade": false,
                    "allowSubmit": false,
                    "defaultPath": "/"
                  },
                  "kind": "jupyter"
                },
                "workspaceId": "reserved"
              },
              "starter_files": null
            }
          ]
        },
        {
          "id": 751853,
          "key": "480e9dc2-4726-4582-81d7-3b8e6a863450",
          "title": "Starbucks Project Overview",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "480e9dc2-4726-4582-81d7-3b8e6a863450",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 759711,
              "key": "b117d163-7035-4e37-a980-12938a0235b2",
              "title": "Capstone",
              "semantic_type": "VideoAtom",
              "is_public": true,
              "instructor_notes": "",
              "video": {
                "youtube_id": "bq-H7M5BU3U",
                "china_cdn_id": "bq-H7M5BU3U.mp4"
              }
            },
            {
              "id": 759986,
              "key": "4f09bdca-39ec-4322-8031-92a40808c3ec",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Starbuck's Capstone Challenge\n\nInstructions for the project can be found in the Starbucks Project Workspace.\n\n## Dataset overview\n\n- The program used to create the data simulates how people make purchasing\n  decisions and how those decisions are influenced by promotional offers.\n- Each person in the simulation has some hidden traits that influence their\n  purchasing patterns and are associated with their observable traits. People\n  produce various events, including receiving offers, opening offers, and making\n  purchases.\n- As a simplification, there are no explicit products to track. Only the\n  amounts of each transaction or offer are recorded.\n- There are three types of offers that can be sent: buy-one-get-one (BOGO),\n  discount, and informational. In a BOGO offer, a user needs to spend a certain\n  amount to get a reward equal to that threshold amount. In a discount, a user\n  gains a reward equal to a fraction of the amount spent. In an informational\n  offer, there is no reward, but neither is there a requisite amount that the user\n  is expected to spend. Offers can be delivered via multiple channels.\n- The basic task is to use the data to identify which groups of people are most\n  responsive to each type of offer, and how best to present each type of offer.\n\n## Data Dictionary\n\n### profile.json\n\nRewards program users (17000 users x 5 fields)\n\n- gender: (categorical) M, F, O, or null\n- age: (numeric) missing value encoded as 118\n- id: (string/hash)\n- became_member_on: (date) format YYYYMMDD\n- income: (numeric)\n\n### portfolio.json\n\nOffers sent during 30-day test period (10 offers x 6 fields)\n\n- reward: (numeric) money awarded for the amount spent\n- channels: (list) web, email, mobile, social\n- difficulty: (numeric) money required to be spent to receive reward\n- duration: (numeric) time for offer to be open, in days\n- offer_type: (string) bogo, discount, informational\n- id: (string/hash)\n\n### transcript.json\n\nEvent log (306648 events x 4 fields)\n\n- person: (string/hash)\n- event: (string) offer received, offer viewed, transaction, offer completed\n- value: (dictionary) different values depending on event type\n  - offer id: (string/hash) not associated with any \"transaction\"\n  - amount: (numeric) money spent in \"transaction\"\n  - reward: (numeric) money gained from \"offer completed\"\n- time: (numeric) hours after start of test",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 751859,
          "key": "59623bdf-9fdf-4b34-a5f8-c56dc75fc512",
          "title": "Starbucks Project Workspace",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "59623bdf-9fdf-4b34-a5f8-c56dc75fc512",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 760006,
              "key": "e731721a-45c9-421f-9527-b6c716e76247",
              "title": null,
              "semantic_type": "WorkspaceAtom",
              "is_public": true,
              "workspace_id": "view98n6mw6nlkh",
              "pool_id": "jupyter",
              "view_id": "jupyter-d3j7fvxar18",
              "gpu_capable": false,
              "configuration": {
                "id": "reserved",
                "blueprint": {
                  "conf": {
                    "disk": null,
                    "ports": [],
                    "allowGrade": false,
                    "allowSubmit": false,
                    "defaultPath": "/notebooks/Starbucks_Capstone_notebook.ipynb"
                  },
                  "kind": "jupyter"
                },
                "workspaceId": "reserved"
              },
              "starter_files": null
            }
          ]
        },
        {
          "id": 728030,
          "key": "65160313-7054-4ffb-8263-793e2a166d69",
          "title": "CNN Project: Dog Breed Classifier",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "65160313-7054-4ffb-8263-793e2a166d69",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 728248,
              "key": "22e50366-37e8-4aa6-870c-562dfc7a47f6",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Project Overview\n\nWelcome to the Convolutional Neural Networks (CNN) project! In this project, you will learn how to build a pipeline to process real-world, user-supplied images.  Given an image of a dog, your algorithm will identify an estimate of the canine’s breed.  If supplied an image of a human, the code will identify the resembling dog breed.  \n\nAlong with exploring state-of-the-art CNN models for classification, you will make important design decisions about the user experience for your app.  Our goal is that by completing this lab, you understand the challenges involved in piecing together a series of models designed to perform various tasks in a data processing pipeline.  Each model has its strengths and weaknesses, and engineering a real-world application often involves solving many problems without a perfect answer.  Your imperfect solution will nonetheless create a fun user experience!",
              "instructor_notes": ""
            },
            {
              "id": 728268,
              "key": "5dbe0b6f-0f3e-4088-b466-945e69d5a4ba",
              "title": null,
              "semantic_type": "ImageAtom",
              "is_public": true,
              "url": "https://video.udacity-data.com/topher/2017/May/59135704_sample-dog-output/sample-dog-output.png",
              "non_google_url": "https://s3.cn-north-1.amazonaws.com.cn/u-img/5dbe0b6f-0f3e-4088-b466-945e69d5a4ba",
              "caption": "Example dog breed output.",
              "alt": "",
              "width": 300,
              "height": 330,
              "instructor_notes": null
            },
            {
              "id": 728252,
              "key": "c6ac39b8-b398-41ec-8c32-5f18bde6e405",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Project Instructions\n\nClone the project from the GitHub [repository](https://github.com/udacity/deep-learning-v2-pytorch/tree/master/project-dog-classification).  Follow the instructions in the README to complete the project.\n\n## Evaluation\n\nYour project will be reviewed by a Udacity reviewer against the CNN project [rubric](https://review.udacity.com/#!/rubrics/2259/view).  Review this rubric thoroughly, and self-evaluate your project before submission.  All criteria found in the rubric must meet specifications for you to pass.\n\n## Project Submission\n\nWhen you are ready to submit your project, collect the following files and compress them into a single archive for upload:\n- The `dog_app.ipynb` file with fully functional code, all code cells executed and displaying output, and all questions answered.\n- An HTML or PDF export of the project notebook with the name `report.html` or `report.pdf`.\n- Any additional images used for the project that were not supplied to you for the project. _Please_ do not include the project data sets in the `dogImages/` or `lfw/` folders. \n\nAlternatively, your submission could consist of the GitHub link to your repository.\n\n### Ready to submit your project?\n\nClick on the \"Submit Project\" button and follow the instructions to submit!",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 728031,
          "key": "300e50a9-8e85-448e-928e-c10dc64cdf7e",
          "title": "Dog Project Workspace",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "300e50a9-8e85-448e-928e-c10dc64cdf7e",
            "completed_at": "2020-01-17T14:25:10.838Z",
            "last_viewed_at": "2020-01-17T14:25:09.376Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 728250,
              "key": "a54046b5-5a09-4806-9c14-9287a3cad314",
              "title": null,
              "semantic_type": "WorkspaceAtom",
              "is_public": true,
              "workspace_id": "viewjz0ral44olo",
              "pool_id": "jupytergpu",
              "view_id": "jupyter-4a46f7y4z5n",
              "gpu_capable": true,
              "configuration": {
                "id": "reserved",
                "blueprint": {
                  "conf": {
                    "disk": {
                      "id": "mldatasets",
                      "paths": [
                        {
                          "src": "/dog_project/",
                          "dest": "/data/"
                        }
                      ]
                    },
                    "ports": [],
                    "allowGrade": false,
                    "allowSubmit": false,
                    "defaultPath": "/notebooks/dog_project/dog_app.ipynb"
                  },
                  "kind": "jupyter"
                },
                "workspaceId": "reserved"
              },
              "starter_files": null
            }
          ]
        },
        {
          "id": 840699,
          "key": "66f70c9a-9312-436a-b0e5-b5b12eb4fdf1",
          "title": "Selecting One Project",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "66f70c9a-9312-436a-b0e5-b5b12eb4fdf1",
            "completed_at": "2019-12-06T07:34:35.795Z",
            "last_viewed_at": "2019-12-06T08:33:39.542Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 840700,
              "key": "7f1d290b-1673-4f12-8be3-d8c0f40c4d3c",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "## Select a Project\n\nYou've been given three possible project frameworks, but you may come up with your own project too!\n\nSelect one project to pursue and then move on to completing two final tasks:\n1. Writing a Capstone Proposal, outlining your idea and methods for a technical audience.\n2. Completing and submitting final, project code.",
              "instructor_notes": ""
            },
            {
              "id": 840701,
              "key": "d8ae511b-4fe8-4625-9693-834a4ffab844",
              "title": "",
              "semantic_type": "RadioQuizAtom",
              "is_public": true,
              "instructor_notes": null,
              "user_state": {
                "node_key": "d8ae511b-4fe8-4625-9693-834a4ffab844",
                "completed_at": "2019-12-06T08:33:42.916Z",
                "last_viewed_at": "2019-12-06T08:33:42.916Z",
                "unstructured": "{\"selected_id\":\"a1553228702946\",\"is_correct\":true}"
              },
              "question": {
                "prompt": "Choose one of the following options to pursue (there is no wrong answer).",
                "answers": [
                  {
                    "id": "a1553228641164",
                    "text": "Arvato Project",
                    "is_correct": true
                  },
                  {
                    "id": "a1553228688573",
                    "text": "Starbucks Project",
                    "is_correct": false
                  },
                  {
                    "id": "a1553228694372",
                    "text": "Dog Breed Classifier (CNN)",
                    "is_correct": false
                  },
                  {
                    "id": "a1553228702946",
                    "text": "Custom Project (of your own design)",
                    "is_correct": false
                  }
                ]
              }
            }
          ]
        }
      ]
    }
  },
  "_deprecated": [
    {
      "name": "non_google_url",
      "reason": "(2016/8/18) Not sure, ask i18n team for reason"
    }
  ]
}