{
  "data": {
    "lesson": {
      "id": 631257,
      "key": "af569005-7bce-4f72-a95c-0c2aaf71634d",
      "title": "Portfolio Exercise: Upload a Package to PyPi",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": "Create your own Python package and upload your package to PyPi.",
      "lesson_type": "Classroom",
      "display_workspace_project_only": false,
      "resources": null,
      "project": null,
      "lab": null,
      "concepts": [
        {
          "id": 631258,
          "key": "916e05e6-5da6-4b54-90a3-80733f09cda6",
          "title": "Introduction",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "916e05e6-5da6-4b54-90a3-80733f09cda6",
            "completed_at": "2019-11-25T06:49:34.173Z",
            "last_viewed_at": "2019-11-25T06:49:34.019Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 634239,
              "key": "516dacd9-aada-40d1-b3e6-341d0326dceb",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Portfolio Exercise: Upload a Package to PyPi\n\nPersonal portfolios are an excellent way to demonstrate your knowledge and creativity. In fact, they are little by little becoming a must-have for people working in the tech industry. In this portfolio building exercise, you will build a Python package and upload the package to PyPi. \n\n**NOTE that a portfolio exercise like this is NOT reviewed. So you will not submit your work on this, and you do not need to complete this assignment in order to graduate.**",
              "instructor_notes": ""
            },
            {
              "id": 672310,
              "key": "68b93a40-8e32-40cf-8394-c8ba92d12467",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Getting Started\n\nNext, you'll find a blank classroom workspace where you can do your work. The benefits of using the workspace over your own computer are two fold:\n- you shouldn't run into set-up issues\n- if you install something on the workspace that causes issues, you can always reset everything\n\nThe workspace is the same Ubuntu Linux environment you've been using to do the exercises. You are also welcome to develop your package locally on your own computer if you prefer. \n\nFor local development, if you are developing on macOS, you can use the exact same terminal commands. On a windows machine, the commands are slightly different and you'll need to use the command prompt. This link contains a [comparison of MS-DOS vs Linux commands](https://access.redhat.com/documentation/en-US/Red_Hat_Enterprise_Linux/4/html/Step_by_Step_Guide/ap-doslinux.html).  \n\nIf at some point you decide to reset your workspace, make sure you have saved your work somewhere else like in a GitHub repository; otherwise, all of your work will be deleted. You can connect to a remote GitHub repo from within the workspace terminal. Here is a reminder of how to do that: [adding an existing repository to GitHub using the command line](https://help.github.com/articles/adding-an-existing-project-to-github-using-the-command-line/). Another option is to download files or folders directly from the workspace. You right click on the file/folder name and click \"Download\".\n\nIn the workspace, you'll see that the files and folders have already been set up for you in terms of the structure, but the files themselves are empty.\n\nEvery time you type in the workspace, your work is automatically saved. But you should still save and commit your work to GitHub as well.",
              "instructor_notes": ""
            },
            {
              "id": 634240,
              "key": "0a163ff9-2f76-42e1-9bed-8499431c68d0",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Instructions\n\nBuild a Python package and upload the package to PyPi. We encourage you to use object-oriented programming and tackle a problem that interests you. The Introduction to Object-Oriented Programming lesson has all of the information needed to create a package and upload the package. As mentioned in the lesson material, you'll need to use a unique name to upload the package to PyPi since each package needs a unique name; hence 'dsnd-probability' will not work since that package name is already taken.\n\nHere are a few ideas for packages:\n* create a package that does basic matrix algebra such as addition, subtraction, multiplication, matrix inversion, etc.\n* make a calculus package that implements algorithms such as Newton's method\n* create a package built on top of Matplotlib or Seaborn that creates well-formatted, well labeled visualizations \n* create an object-oriented package to play a game of tic-tac-toe between two human players. \n* or make a number guessing game where the computer randomly chooses an integer and then tells a human player if a guess is higher or lower than the number\n\nFeel free to come up with your own ideas. The main goal is to develop and demonstrate your skills in object-oriented programming and uploading packages to PyPi.",
              "instructor_notes": ""
            },
            {
              "id": 634243,
              "key": "223b192c-13c4-4dca-b93f-6c65d3a44894",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Reminders\n\n* include a README file detailing the files in your package and how to install the package.\n* Comment your code - use docstrings and inline comments where appropriate.\n* Refactor code when possible - if you find your functions are getting too long, then refactor your code!\n* Use object-oriented programming whenever it makes sense to do so.\n* You're encouraged to write unit tests! The coding exercises in this lesson contained unit tests, so you can use those tests as a model for your package.\n* Use GitHub for version control, and commit your work often.\n\nAs a reminder, your package should be placed in a folder with the following folders and files:\n* a folder with the name of your package that contains:\n * the Python code that makes up your package\n * a ` README.md`  file\n * an ` __init__.py` \n * `license.txt`\n * `setup.cfg`\n* setup.py file",
              "instructor_notes": ""
            },
            {
              "id": 672229,
              "key": "1a1f73f1-4185-4e2e-9830-278e21746e4d",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Hints and Helpful Links\n\nBecause this exercise requires writing and organizing code in a specific way, you might have to rewatch some of the lecture videos especially the \"Putting Code on PyPi\" concept. \n\nBefore you upload your code to PyPi, you should first pip install the package locally to make sure everything works as expected. The \"Making a Package\" and \"Virtual Environments\" lesson concepts should be helpful. You should also consider writing unit tests to test the functionality of your package. In the object-oriented programming lesson workspace, there were unit tests inside the 4a_binomial_package folder that you can use to help you get started. Those were in a file called test.py.\n\nThe object-oriented programming lesson included a complete, working package called dsnd-probability. We encourage you to code a project from scratch; however, if you get stuck, use the dsnd-probability package code as a template. It already contains all of the necessary files you'll need for creating a package. It's also a simple example of object-oriented code. You can use these files, including the setup.py and setup.cfg files, to help structure your own code. \n\nThose files are located in the \"Exercise: Upload to PyPi\" section inside the \"5_exercise_upload_to_pypi\" folder.\n\nBesides the lesson on object-oriented programming, you might find [this package building summary guide from the Python website](https://packaging.python.org/guides/distributing-packages-using-setuptools/) helpful.\n\nFor a much more detailed explanation of distributing Python packages, check out the documentation on Distutils. \n1. [Introduction](https://docs.python.org/3/distutils/introduction.html)\n2. [setup.py script](https://docs.python.org/3/distutils/setupscript.html)\n3. [config file](https://docs.python.org/3/distutils/configfile.html)\n4. [source distributions](https://docs.python.org/3/distutils/sourcedist.html)\n5. [built distributions](https://docs.python.org/3/distutils/builtdist.html)\n6. [uploading to PyPi](https://docs.python.org/3/distutils/packageindex.html)",
              "instructor_notes": ""
            },
            {
              "id": 634248,
              "key": "b866b981-8f8b-4b54-8e9b-0bb267206dae",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Uploading to PyPi\n\nWhen you are ready to upload your package, you can first upload to the [PyPi test repository](https://test.pypi.org). Once everything is working as expected, you can upload to the public facing [PyPi repository](https://pypi.org).\n\nAs a reminder, you'll need to create a username for both the test and public facing repositories. You'll also need to pip install the twine package with: `pip install twine`. You can rewatch the lesson videos to see how to upload your package.\n\nContinue on to the next sections to get some troubleshooting tips, and access the project workspace. When you're finished with your project, show off your work on a personal website, GitHub, and LinkedIn.",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 672238,
          "key": "a6d12931-ace9-41bd-ae8d-323a4e2c69cc",
          "title": "Troubleshooting Possible Errors",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "a6d12931-ace9-41bd-ae8d-323a4e2c69cc",
            "completed_at": "2019-11-25T06:49:43.486Z",
            "last_viewed_at": "2019-11-25T06:49:43.348Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 672241,
              "key": "17b8b804-a5f4-43dd-b3c0-42f1de974c07",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "If you are having trouble uploading your package to PyPi, here are a few issues that other students have faced.",
              "instructor_notes": ""
            },
            {
              "id": 672239,
              "key": "044a7b97-5b7a-4358-a63a-69437a34ef47",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# PyPi vs. Test PyPi\n\nNote that [pypi.org](https://pypi.org) and [test.pypy.org](https://test.pypi.org) are two different websites.  You'll need to register separately at each website. If you only register at [pypi.org](https://pypi.org), you will not be able to upload to the [test.pypy.org](https://test.pypi.org) repository.",
              "instructor_notes": ""
            },
            {
              "id": 672242,
              "key": "55658af2-6398-4ca4-b094-7af6ba507129",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Unique Name\n\nRemember that your package name must be unique. If you use a package name that is already taken, you will get an error when trying to upload the package.",
              "instructor_notes": ""
            },
            {
              "id": 672257,
              "key": "dba70b97-1d10-4f75-a5c7-5525efa1a75e",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Re-uploading and Versioning\n\nOnce you upload your package to PyPi, you cannot upload the same version again. All that means is that you need to go into your setup.py file and change the version number. For example, if you uploaded a package with `version = 0.1.1`, then you'll need to change this to something else like `version = 0.1.2`. \n\nIf you've ever wondered what all these version numbers mean, here is a tutorial about [semantic versioning](https://semver.org/). Semantic versioning is a standard for deciding when to move up to the next number in your versioning scheme.",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 634244,
          "key": "c68f8fc0-8864-4ede-8255-6ee195873895",
          "title": "Workspace",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "c68f8fc0-8864-4ede-8255-6ee195873895",
            "completed_at": "2019-11-25T06:49:44.516Z",
            "last_viewed_at": "2019-11-25T06:49:44.353Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 634246,
              "key": "2bcf7716-2f1f-41d5-a562-5c36876219fc",
              "title": null,
              "semantic_type": "WorkspaceAtom",
              "is_public": true,
              "workspace_id": "view972cef1a",
              "pool_id": "webterminal",
              "view_id": "972cef1a-7008-43cf-8d94-5fdbe1a254f3",
              "gpu_capable": false,
              "configuration": {
                "id": "reserved",
                "blueprint": {
                  "conf": {
                    "disk": null,
                    "port": 3000,
                    "ports": [],
                    "userCode": "",
                    "openFiles": [],
                    "showFiles": true,
                    "allowClose": true,
                    "allowSubmit": false
                  },
                  "kind": "generic"
                },
                "workspaceId": "reserved"
              },
              "starter_files": null
            }
          ]
        }
      ]
    }
  }
}