{
  "data": {
    "lesson": {
      "id": 947975,
      "key": "02bbb8a6-89f4-4e48-9fab-5bf409ac38df",
      "title": "Pitch a Product Vision",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": null,
      "lesson_type": "Classroom",
      "display_workspace_project_only": false,
      "resources": {
        "files": [
          {
            "name": "Product Pitch Template",
            "uri": "https://video.udacity-data.com/topher/2019/October/5d93921e_product-pitch-template/product-pitch-template.pptx"
          }
        ],
        "google_plus_link": null,
        "career_resource_center_link": null,
        "coaching_appointments_link": null,
        "office_hours_link": null,
        "aws_provisioning_link": null
      },
      "project": {
        "key": "9b636a7e-05a9-495e-b1df-d0218d23a150",
        "version": "1.0.0",
        "locale": "en-us",
        "duration": 36000,
        "semantic_type": "Project",
        "title": "Pitch a Product Vision",
        "description": "**Make a copy of this [Google doc template](https://docs.google.com/presentation/d/1uxPVPwZ7dkHQwb0gRUrjxg43Rh7VOew6avlAUsEFJ2U/copy)** or download the PPT template from the resource section of this project. Make sure to complete each section. When you are ready, save your file as a PDF and submit it.\n\n\n<center><a href=\"https://docs.google.com/presentation/d/1uxPVPwZ7dkHQwb0gRUrjxg43Rh7VOew6avlAUsEFJ2U/copy\n\" target=\"_blank\"><button style=\"box-sizing: border-box; border-radius: 4px; background: #02B3E4; border: none; height: 44px; padding: 0 25px; color: white; cursor: pointer; font-family: Open Sans,sans-serif; display: inline-block; border: none; font-size: 12px; letter-spacing: 1px; font-weight: 600; text-transform: uppercase;\">Go to Project Template</button></a></center>\n\n# Submission Requirements:\n- A PDF copy of your final Product Pitch (see template from the link above or download PPT file from the resources section)\n- A 10-minute video presenting an overview of the product opportunity for an executive stakeholder\n\nCheck out the [Rubric](https://review.udacity.com/#!/rubrics/2696/view) for this project.",
        "is_public": true,
        "summary": null,
        "forum_path": "",
        "rubric_id": "2696",
        "terminal_project_id": null,
        "resources": {
          "files": [
            {
              "name": "Product Pitch Template",
              "uri": "https://video.udacity-data.com/topher/2019/October/5d9391fc_product-pitch-template/product-pitch-template.pptx"
            }
          ],
          "google_plus_link": null,
          "career_resource_center_link": null,
          "coaching_appointments_link": null,
          "office_hours_link": null,
          "aws_provisioning_link": null
        },
        "image": null
      },
      "lab": null,
      "concepts": [
        {
          "id": 947977,
          "key": "86595e1a-cfd1-4c2a-91a9-449927e81eba",
          "title": "Instructions",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "86595e1a-cfd1-4c2a-91a9-449927e81eba",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 947978,
              "key": "1da77366-c65b-4f33-a249-39249c35ce1d",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "Now that you’ve gone through the course material, it’s time to prepare your project.\nFirst, choose from the following scenarios:\n\n- **Option 1**: Kaiser Permanente is looking to enter into the preventative care space to help their patient base increase physical activity and improve on healthy habits.  While the overall goal is improved patient satisfaction and well being, the specific financial goal is reduced cost by emphasizing improved health prior to any adverse conditions developing.  Overall, KP wants to decrease spending on conditions such as type 2 diabetes.  <br> \nYour team is tasked with researching the potential costs, features and benefits of a mobile application that communicates with KP patients and helps them improve on healthy habits.  \n <br> \n- **Option 2**: Doordash is looking to automate food delivery using self-driving robots for trips that are less than 2 miles in order to reduce its operating costs and provide more reliable delivery times. The long term goal is that these delivery robots will navigate sidewalks fully autonomously. But initially, there may be times when manual intervention will be required. <br> \nYour team has been tasked with building a tool for the operations team-- to view the status of deliveries and remotely take control of robots that need intervention (ie: rerouting).  \n <br> \n- **Option 3**: Amazon is the world leader in self-publishing for books.  They would now like to explore entering into another self-publishing media vertical and are considering either self-published videos or self-published music. <br> \nYour team is tasked with research these two verticals and deciding which one seems like a better opportunity based on existing competition, synergy with other Amazon offerings, ease of building an offer and potential revenues.  \n <br> \n- **Option 4**: LinkedIn is trying to expand its job market offerings by creating an app that will recommend the best jobs to recent college graduates based on their skills and preferences. <br> \nYour team has been tasked with researching the market for this offering, the kinds of data needed, how to connect this with other LinkedIn offerings and how to best monetize it. <br> \n\n\nOur recommendation would be to do 20 to 30 minutes of research on each of these before deciding on a specific one.  Google the company and the market, do some searches on competitors you might already know about or terms like “competitors”, “Total Addressable Market” or “revenue” related to this market.  In other words, get to know the material and the market and then choose the one that seems most interesting to you.\n\nFor example, if you’re researching use case 1, look up:\n\n- Preventable diseases\n- Kaiser Permanente subscriber base\n- Kaiser Permanente revenues\n- Fitness applications\n- Health care\n\nAnd see where each one of these searches takes you.\n\nYour goal will be to research this opportunity, create a pitch deck for the product you hope to build, and then present it.  \n\nMake a copy of this **[Google doc Starter Template](https://docs.google.com/presentation/d/1uxPVPwZ7dkHQwb0gRUrjxg43Rh7VOew6avlAUsEFJ2U/copy)** or download the PPT template from the resource section of this project. Complete each section to create a pitch deck for the product you hope to build.\n\nYour project will be evaluated on the following dimensions:\n\n1. **Credibility**: Does the presentation sound credible?  Here’s where your research will come in handy.  Are you backing up your assertions and statements of facts with citations and links?  Does the opportunity you describe sound approachable? Many students will make the mistake of aiming too high “we aim to replace Facebook.\"  This is simply not credible in a pitch deck.  A more credible statement might be “we aim to become the social network for politically active millennials”.<br><br>\nThe same applies to business cases.  If your business case is too detailed it starts becoming brittle.  A brittle business case is one that’s based on too many assumptions.  It’s the epitome of “too many if’s”.  For example “If we assume that 20% of millennials are interested in advocacy and if out of that 20 %, 10% are unsatisfied in Facebook and if we can get them to log in 3 times a week and if we assume they click on an ad once out of three visits and if we assume each ad generates \\$1 then our return on investment is…”  This business case is brittle.  If any of these assumptions are wrong then it falls apart.  Even worse, if your stakeholder audience gets lost in all these assumptions, you will lose their attention.  Consider the following instead: “Facebook currently generates \\$55B a year from 2.4B active users.  If we can draw in 1% of that audience (24 million users, which is less than 5% of the available millennial audience), that would represent 55 million a year in revenue at a monetization rate 10 times worse than Facebook’s.” <br><br>\nNotice that difference here.  You’re using clear and publicly available numbers and you’re being conservative.  You’re saying that if you manage to draw in just 5% of millennials at a very poor monetization rate, you’ll still be making $55 million a year.  It’s easy to follow and simple to understand.\n<br><br>\n- **Delivery**: Yes, even the best products live or die by the delivery of their pitch.  A product might be incredible but if the product manager’s delivery is poor, no one will invest in it.  At the same time, bad products can get investment with good pitches.   If you’re thinking to yourself “how the heck did things like Sharknado 4, Juicero, Microsoft Bob and the watermelon oreo (yes, that was a thing) ever get funded?” It's because some product managers out there made a heck of a pitch presentation.  For your delivery, remember two things.  Look knowledgeable and look positive.  <br>\nLooking knowledgeable means knowing your material.  If it seems like you’re just reading off bullet points from a slide, your audience will assume you’re not knowledgeable.  The bullet points are there to summarize what you’re going to say, not provide a script.\n<br><br>\nLooking positive means sounding like you believe in this product.  You need to be the cheerleader of your product because no one else will.  When you talk about your product you should sound positive, excited and happy.  This is based on product management and it’s the key to getting your ideas approved as opposed to always working on someone else’s ideas.\n",
              "instructor_notes": ""
            }
          ]
        }
      ]
    }
  }
}