{
  "id": 2696,
  "project_id": 650,
  "upload_types": [
    "zip"
  ],
  "file_filter_regex": "\\A(?!(((.*/)?(__MACOSX|\\.git|node_modules|bower_components|jspm_packages|\\.idea|build|.ipynb_checkpoints|\\.Trash-0|logs)(\\Z|/))))((.*\\.(js|css|py|html|htm|txt|md|markdown|sql|swift|java|ts|gradle|xml|rst|yml|yaml|rmd|pdf|docx|h|H|hh|hxx|h\\+\\+|c|C|cc|cpp|cxx|c\\+\\+)\\Z)|((.*/)?(README|Readme|readme|Makefile)\\Z))",
  "nomination_eligible": false,
  "stand_out": "1. Deliver a partnerships slide discussing which 3rd party partners this product may want to connect with\n2. Deliver a Go-To-Market slide discussing how the product will be introduced to the market and the characteristics of the ideal customer",
  "hide_criteria": false,
  "created_at": "2019-10-01T17:04:29.194Z",
  "updated_at": "2020-04-15T00:03:31.546Z",
  "hashtag": "",
  "max_upload_size_mb": 500,
  "estimated_sla": null,
  "project_assistant_enabled": false,
  "checkmate_enabled": false,
  "checkmate_metadata": null,
  "available_for_cert_project": false,
  "classroom_node_id": 947976,
  "classroom_project_key": "9b636a7e-05a9-495e-b1df-d0218d23a150",
  "language": "en-us",
  "ndkeys": [
    "nd036-beta",
    "nd036-cn",
    "nd036",
    "nd036-ent",
    "nd-instructor"
  ],
  "coursekeys": [],
  "sections": [
    {
      "id": 5974,
      "name": "Business Case",
      "created_at": "2020-02-11T16:21:05.538Z",
      "updated_at": "2020-02-11T16:21:16.023Z",
      "deleted_at": null,
      "position": 0,
      "rubric_id": 2696,
      "rubric_items": [
        {
          "id": 17145,
          "section_id": 5974,
          "passed_description": "Have you outlined a problem worth solving?  This isn’t just a fun product to build, it should be a product that solves someone’s pain.  \n\nHave you clearly articulated what that pain is?  For example, in our sample project, we articulate the pain of “we are wasting 33 million a year in health care costs on diabetes care that could be saved”.  That’s pain, and it’s pain that someone might be interested in solving.\n\n- Included specific metrics to back up your claim\n- Included potential cause(s)\n- Included a call to action that would resonate with stakeholders",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:21:16.358Z",
          "updated_at": "2020-02-11T16:52:26.924Z",
          "deleted_at": null,
          "optional": false,
          "position": 0,
          "criteria": "**Initial Focus**\n\nIdentify problems to solve by creating a compelling story using evidence and metrics",
          "exceedable": false
        },
        {
          "id": 17146,
          "section_id": 5974,
          "passed_description": "Have you quantified the size of the opportunity?  It can’t be something as all-encompassing as “the market for diabetes treatment is $300B”.  \n\nWhat piece of this market are you approaching?  How big is it?  Why only this piece?  TAM (Total Addressable Market) should usually be counted in billions.  Anything with a B in front of it is probably a good TAM.  That said, your focus area will have a return significantly lower than the total TAM.\n\nUse links and sources where possible.  This doesn’t need to be comprehensively footnoted, but quotes and numbers are always more believable when the source is mentioned",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:22:08.768Z",
          "updated_at": "2020-02-11T16:23:56.915Z",
          "deleted_at": null,
          "optional": false,
          "position": 1,
          "criteria": "**Opportunity**\n\nCalculate the total addressable market (TAM) for your product",
          "exceedable": false
        },
        {
          "id": 17147,
          "section_id": 5974,
          "passed_description": "State what you want to build.  Give brief details at a high level of functionality, just enough for readers to understand the proposal\n\nHave you outlined a clear solution to that problem?  Will a reader or viewer understand what you’re proposing to build?  It can’t be something vague like “I will build a marketplace!”  It has to be specific.  What kind of marketplace?  What does it do?  How is it special?  What audience does it address?\n",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:23:57.177Z",
          "updated_at": "2020-02-11T16:24:41.274Z",
          "deleted_at": null,
          "optional": false,
          "position": 2,
          "criteria": "**Proposal**\n\nDefine product use cases and target user(s)",
          "exceedable": false
        },
        {
          "id": 17148,
          "section_id": 5974,
          "passed_description": "What do you think this will cost?  What do you think this will produce in terms of revenue or cost savings?  What is the return on investment?   \n\nYou don’t need to provide an extremely detailed business case here, that’s usually provided as supporting material.   Detailed spreadsheets are often too brittle because they rely on numerous assumptions, any one of which being wrong will throw the entire ROI calculation off.  Think simple calculations instead.  X months of development * 10k each / some simple measure of return.",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:24:41.641Z",
          "updated_at": "2020-02-11T16:25:24.290Z",
          "deleted_at": null,
          "optional": false,
          "position": 3,
          "criteria": "**ROI**\n\nCalculate the return on investment",
          "exceedable": false
        },
        {
          "id": 17149,
          "section_id": 5974,
          "passed_description": "How will you measure the success of your idea?  What is the goal for the first year?",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:25:24.540Z",
          "updated_at": "2020-02-11T16:26:01.967Z",
          "deleted_at": null,
          "optional": false,
          "position": 4,
          "criteria": "**Measurement**\n\nDefine success metrics",
          "exceedable": false
        }
      ]
    },
    {
      "id": 5975,
      "name": "Competitors",
      "created_at": "2020-02-11T16:26:02.477Z",
      "updated_at": "2020-02-11T16:26:13.523Z",
      "deleted_at": null,
      "position": 1,
      "rubric_id": 2696,
      "rubric_items": [
        {
          "id": 17150,
          "section_id": 5975,
          "passed_description": "Outline at least two competitors.  Remember that these don’t need to be exact competitors but might be companies in the same general field.  For example, YouTube competitors might be Amazon Video but they may also be traditional TV networks.  You may want to highlight a category of competitors instead of a specific one (e.g. Traditional TV networks as opposed to NBC)\n\nFor each competitor give a brief overview of at least 4 features.  Provide enough so that the audience can understand their offering.",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:26:13.939Z",
          "updated_at": "2020-02-11T16:55:08.369Z",
          "deleted_at": null,
          "optional": false,
          "position": 0,
          "criteria": "**Competitors**\n\nCompare the features of competitor products/solutions",
          "exceedable": false
        },
        {
          "id": 17151,
          "section_id": 5975,
          "passed_description": "Then follow this up with a slide outlining why your product is better.  This slide should answer the question of “why us?”  Why should a buyer choose your product as opposed to one of the competitors?\n\nRemember that the best competitive advantages are ones that are hard for competitors to match.  For example, network effects, unique business partnerships, and unique content are hard for competitors to match.  Pricing is not.",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:28:22.767Z",
          "updated_at": "2020-02-11T16:28:57.246Z",
          "deleted_at": null,
          "optional": false,
          "position": 1,
          "criteria": "**Advantages**\n\nDefine product positioning and opportunity in the market.",
          "exceedable": false
        }
      ]
    },
    {
      "id": 5976,
      "name": "Roadmap and Vision",
      "created_at": "2020-02-11T16:28:57.769Z",
      "updated_at": "2020-02-11T16:29:08.225Z",
      "deleted_at": null,
      "position": 2,
      "rubric_id": 2696,
      "rubric_items": [
        {
          "id": 17152,
          "section_id": 5976,
          "passed_description": "**What is your vision?** \n\nIs there a strategy behind the roadmap or is it simply a list of follow up items?  A strategy means a goal.  Provide at least 2 themes corresponding to the future strategy of the product.\n\nFor example, your strategy might be “expand into other geographical markets by investing in UI translations and regional specific features”.\n",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:29:08.516Z",
          "updated_at": "2020-02-11T16:31:20.836Z",
          "deleted_at": null,
          "optional": false,
          "position": 0,
          "criteria": "Define and craft compelling vision and strategy",
          "exceedable": false
        },
        {
          "id": 17153,
          "section_id": 5976,
          "passed_description": "For each strategic theme, provide two or three features that you want to develop for this theme along with a brief explanation on each.\n\nThe list of features on the roadmap should flow from your vision and strategies.",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:31:21.166Z",
          "updated_at": "2020-02-11T16:32:04.656Z",
          "deleted_at": null,
          "optional": false,
          "position": 1,
          "criteria": "Build a roadmap around the identified strategic areas",
          "exceedable": false
        }
      ]
    },
    {
      "id": 5977,
      "name": "Presentation & Delivery",
      "created_at": "2020-02-11T16:32:05.074Z",
      "updated_at": "2020-02-11T16:32:22.557Z",
      "deleted_at": null,
      "position": 3,
      "rubric_id": 2696,
      "rubric_items": [
        {
          "id": 17154,
          "section_id": 5977,
          "passed_description": "Use the provided template and fill out the slides applicable to your product.  Don’t try to invent a new process where one already exists.  Don’t try to make what you’re doing “special”.  Follow the process.  In this case, we are providing you with a template.  In real-life scenarios, you can find a template through other PM’s at your company.  Don’t reinvent the wheel and don’t bring an unfamiliar template to your stakeholders if they’re used to information being presented a certain way.  It’s distracting and will detract from your message.\n\nAdditionally, pay attention to the way that you craft your presentation. Visually, this also means the manner in which your slides are created.  General rules for slides:\n- Each slide should have a key take away\n- Content on each slide should be focused on supporting the key takeaway\n   - A slide shouldn’t have more than 5 top-level bullets\n    - Each top-level bullet should not have more than 3 sub-bullets\n    - Each bullet or sub-bullet should not have more than one complete sentence.  Preferably, each bullet or sub-bullet is just a sentence fragment\n- Formatting (font, sizes, etc)  should be consistent.  Be careful of text you copied and pasted into the presentation, it will frequently carry over its own formatting\n- Use at least 3 visuals (like graphs and images) when appropriate to make it easier to understand your message\n",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:32:22.994Z",
          "updated_at": "2020-02-11T16:35:11.367Z",
          "deleted_at": null,
          "optional": false,
          "position": 0,
          "criteria": "Create a compelling presentation",
          "exceedable": false
        },
        {
          "id": 17155,
          "section_id": 5977,
          "passed_description": "Create a video recording of yourself giving your presentation. You’ll want to make sure to do a screen capture of your slides, as well as the audio of you explaining each slide.\n\nOn a Mac, you can use QuickTime Player.\nOn a PC you can use the built-in Screen Recording Tool (Windows 10).\n\nThere are also many other free apps available for recording your screen and audio (including [Zoom](https://www.zoom.us/))\n\nNote: Make sure you are also capturing audio from your microphone\n\nRemember, your presentation should be 10 minutes and no longer. Pitch presentations are usually short on time and you need to practice delivering your idea in a succinct manner.\n\nMake sure that you have smooth transitions between all slides and topics. \n\nMake sure you are able to speak to the idea instead of just reading off bullet points?  You need to know your product.  If it feels like you’re reading bullet points, people will lose confidence. And watch out for pauses (unless for dramatic effect)\n\nDo you sound positive and confident when talking about your product idea?  You are the cheerleader for your product.  You are always positive about it.  You always believe in it.  If you don’t, no one will.\n",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:35:11.869Z",
          "updated_at": "2020-02-11T16:37:08.426Z",
          "deleted_at": null,
          "optional": false,
          "position": 1,
          "criteria": "Present a 10-minute overview of the product opportunity to an executive stakeholder",
          "exceedable": false
        },
        {
          "id": 17156,
          "section_id": 5977,
          "passed_description": "Use the three different types of persuasion when building and delivering your presentation:\n- Credibility\n    - Use and cite credible sources when appropriate (at least 2)\n- Emotion\n     - Include a message that makes your audience feel a specific way\n- Logic\n    - Present facts",
          "exceeded_description": null,
          "created_at": "2020-02-11T16:37:08.743Z",
          "updated_at": "2020-02-11T16:57:46.833Z",
          "deleted_at": null,
          "optional": false,
          "position": 2,
          "criteria": "Be persuasive",
          "exceedable": false
        }
      ]
    }
  ],
  "project": {
    "id": 650,
    "name": "Pitch a Product Vision",
    "nanodegree_key": "nd036",
    "is_cert_project": false,
    "audit_project_id": null,
    "hashtag": null,
    "audit_rubric_id": null,
    "entitlement_required": false,
    "is_career": false,
    "recruitment_family_id": 8,
    "awaiting_review_count": 0,
    "awaiting_review_count_by_language": {},
    "awaiting_audit_count": 0,
    "awaiting_quality_audit_count": 0,
    "awaiting_training_audit_count": 0,
    "created_at": "2019-10-01T18:17:10.267Z",
    "updated_at": "2020-05-01T18:32:38.716Z",
    "price": "8.0",
    "ungradeable_price": "3.0",
    "audit_price": null
  }
}