{
  "data": {
    "lesson": {
      "id": 844043,
      "key": "251a9fdb-b855-4582-9fe6-0410ca09f14e",
      "title": "Writing up a Capstone Proposal",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": null,
      "lesson_type": "Classroom",
      "display_workspace_project_only": null,
      "resources": null,
      "project": {
        "key": "c5b455ed-ce8c-4a28-9704-fa6b684cc7a2",
        "version": "1.0.0",
        "locale": "en-us",
        "duration": 10080,
        "semantic_type": "Project",
        "title": "Capstone Proposal",
        "description": "In this capstone project proposal, prior to completing the following **Capstone Project**, you will leverage what you’ve learned throughout the Nanodegree program to author a proposal for solving a problem of your choice by applying machine learning algorithms and techniques. A project proposal encompasses seven key points: \n- The project's **domain background** — the field of research where the project is derived;\n- A **problem statement** — a problem being investigated for which a solution will be defined;\n- The **datasets and inputs** — data or inputs being used for the problem;\n- A **solution statement** — the solution proposed for the problem given;\n- A **benchmark model** — some simple or historical model or result to compare the defined solution to;\n- A set of **evaluation metrics** — functional representations for how the solution can be measured;\n- An outline of the **project design** — how the solution will be developed and results obtained.\n\nThink about a technical field or domain that you are passionate about, such as robotics, virtual reality, finance, natural language processing, or even artificial intelligence (the possibilities are endless!). Then, choose an existing problem within that domain that you are interested in which you could solve by applying machine learning algorithms and techniques. Be sure that you have collected all of the resources needed (such as datasets, inputs, and research) to complete this project, and make the appropriate citations wherever necessary in your proposal. \n\nIn addition, you may find a technical domain (along with the problem and dataset) as *competitions* on platforms such as [Kaggle](http://kaggle.com), or [Devpost](http://devpost.com). This can be helpful for discovering a particular problem you may be interested in solving as an alternative to the suggested problem areas above. In many cases, some of the requirements for the capstone proposal are already defined for you when choosing from these platforms. \n\n### Evaluation\nYour project will be reviewed by a Udacity reviewer against the **<a href=\"https://review.udacity.com/#!/rubrics/410/view\" target=\"_blank\">Capstone Project Proposal rubric</a>**. Be sure to review this rubric thoroughly and self-evaluate your project before submission. All criteria found in the rubric must be *meeting specifications* for you to pass.\n\n### Submission Files\nAt a minimum, your submission will be required to have the following files listed below. If your submission method of choice is uploading an archive (`*.zip`), please take into consideration the total file size. You will need to include\n- A project proposal, *in PDF format only*, with the name **proposal.pdf**, addressing each of the seven key points of a proposal. The recommended page length for a proposal is approximately *two to three pages*.\n- Any additional supporting material such as datasets, images, or input files that are necessary for your project and proposal. If these files are too large and you are uploading your submission, instead provide appropriate means of acquiring the necessary files in an included `README.md` file.\n\nOnce you have collected these files and reviewed the project rubric, proceed to the project submission page.\n\n### I'm Ready!\nWhen you're ready to submit your project, click on the **Submit Project** button at the bottom of the page.\n\nIf you are having any problems submitting your project or wish to check on the status of your submission, please email us at **machine-support@udacity.com** or visit us in the <a href=\"http://discussions.udacity.com\" target=\"_blank\">discussion forums</a>.\n\n### What's Next?\nYou will get an email as soon as your reviewer has feedback for you. In the meantime, review your next project and feel free to get started on it or the courses supporting it!",
        "is_public": true,
        "summary": null,
        "forum_path": "c/nd009-capstone",
        "rubric_id": "2540",
        "terminal_project_id": null,
        "resources": null,
        "image": null
      },
      "lab": null,
      "concepts": [
        {
          "id": 858985,
          "key": "f9d3dd5c-d6ce-4fde-be4f-a4260f7a549a",
          "title": "Capstone Proposal",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "f9d3dd5c-d6ce-4fde-be4f-a4260f7a549a",
            "completed_at": "2019-12-05T14:50:51.262Z",
            "last_viewed_at": "2019-12-31T15:57:47.172Z",
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 858986,
              "key": "6dc96db4-40d8-4dcc-8b18-2590dab07237",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "Welcome to the capstone proposal. Continue to the project submission page to get more information.",
              "instructor_notes": ""
            }
          ]
        }
      ]
    }
  }
}