{
  "data": {
    "lesson": {
      "id": 847454,
      "key": "15b28efe-ed42-4690-8b66-6283edd57486",
      "title": "Welcome to the Data Visualization Nanodegree program",
      "semantic_type": "Lesson",
      "is_public": true,
      "version": "1.0.0",
      "locale": "en-us",
      "summary": "Welcome to the Data Visualization Nanodegree program! In this lesson, you will learn more about the structure of the program and meet the team.",
      "lesson_type": "Classroom",
      "display_workspace_project_only": false,
      "resources": {
        "files": [
          {
            "name": "Videos Zip File",
            "uri": "https://zips.udacity-data.com/15b28efe-ed42-4690-8b66-6283edd57486/847454/1558592137390/Welcome+to+the+Data+Visualization+Nanodegree+program+Videos.zip"
          },
          {
            "name": "Transcripts Zip File",
            "uri": "https://zips.udacity-data.com/15b28efe-ed42-4690-8b66-6283edd57486/847454/1558592134896/Welcome+to+the+Data+Visualization+Nanodegree+program+Subtitles.zip"
          }
        ],
        "google_plus_link": null,
        "career_resource_center_link": null,
        "coaching_appointments_link": null,
        "office_hours_link": null,
        "aws_provisioning_link": null
      },
      "project": null,
      "lab": null,
      "concepts": [
        {
          "id": 848055,
          "key": "83db7875-aca1-4b4c-8ea4-f0ae90c9db0c",
          "title": "Nanodegree Introduction",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "83db7875-aca1-4b4c-8ea4-f0ae90c9db0c",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 850012,
              "key": "50d7eb14-39da-459f-a59b-da567f863700",
              "title": "Mal Intro",
              "semantic_type": "VideoAtom",
              "is_public": true,
              "instructor_notes": "",
              "video": {
                "youtube_id": "rfIa6xNa0mw",
                "china_cdn_id": "rfIa6xNa0mw.mp4"
              }
            }
          ]
        },
        {
          "id": 850249,
          "key": "04ee40c9-30e9-44f9-b9e5-ebc15abe6c10",
          "title": "How can I apply the skills I learn to my job? ",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "04ee40c9-30e9-44f9-b9e5-ebc15abe6c10",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 850250,
              "key": "788e107e-be7a-4c38-bf76-b694512162f3",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "Our instructor, Ben Jones, talks about how he has applied data visualization skills throughout his career. Take a look!",
              "instructor_notes": ""
            },
            {
              "id": 850254,
              "key": "0e442be7-9451-4970-9ce4-44e72a8359af",
              "title": "DSTND Course4 Ben Interview",
              "semantic_type": "VideoAtom",
              "is_public": true,
              "instructor_notes": "",
              "video": {
                "youtube_id": "0bgTew4kUP0",
                "china_cdn_id": "0bgTew4kUP0.mp4"
              }
            }
          ]
        },
        {
          "id": 848056,
          "key": "9b9947ac-1234-4bac-978c-e3dd871fd7e5",
          "title": "What you will build",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "9b9947ac-1234-4bac-978c-e3dd871fd7e5",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 848065,
              "key": "faea7ab8-2da3-40be-a916-972abee298b9",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Project Portfolio\nReal-world projects are integral to every Udacity Nanodegree program. They become the foundation for a job-ready portfolio to help learners advance their careers in their chosen field. The projects in the Data Visualization Nanodegree program were designed in collaboration with a group of highly talented industry professionals to ensure you develop the most in-demand skills. Every project in a Nanodegree program is human-graded by a member of Udacity’s reviewer network. These project reviews include detailed, personalized feedback on how you can improve their work. Udacity graduates consistently rate projects and project reviews as one of the best parts of their experience with Udacity.\n\n### Project 1 - Intro to Data Visualization course project\nIn this project, you'll create visualizations to reveal insights from a data set. You will create data visualizations that tell a story or highlight patterns in the data set. Your work should be a reflection of the theory and practice of data visualization, such as visual encodings, design principles, and effective communication.\n\n### Project 2 - Dashboards course midterm project\nDesign a dashboard for a specific audience which you’ll define by their graphicacy, data literacy, domain expertise, user type (frequent/infrequent), metrics that matter most and any other attributes that might influence the design. This dashboards’ main purpose is to ensure the appropriate data has been chosen for decisions needing to be made. Students will use the Superstore dataset from Tableau for this project. \n\n### Project 3 - Dashboards course final project\nIn this project, students will make the dashboard truly insightful by adding design elements that draw the user’s eye to points of interest based on data. Students will transform their visualizations to emphasize the most important points of interests and add interactivity further facilitating the users desired actions.\n\n### Project 4 - Data Storytelling course midterm project \nIn this project, students will apply the skills they’ve learned in structuring a data story. They will be provided with a Movies Metadata CSV and will have the ability to define their own problem statement, the analyses they’d conduct to solve the objective, and outline a set of potential solutions/actionable next steps for their target audience.\n\n### Project 5 - Data Storytelling course final project\nIn this project, students will understand how to identify the limitations and biases in data that affect the recommendations they provide to their management team. In addition, they’ll put it all together by combining their ghost deck and their analyses to provide a final recommendation. Students will use the same Movies Metadata CSV and conduct the EDA necessary to understand the dataset as a whole. The expected output from students will be to surface if the dataset is balanced, if there are anomalies in the dataset that affect the applicability of the recommendation, and the final presentation itself that will be used for a mock recommendation to a management team.\n\n### Project 6 - Advanced Data Storytelling course midterm project\nIn this project, students will apply the skills they have acquired in this Advanced Data Storytelling course to use the World Bank Indicators data file to create an interactive data presentation using indicators of their choice. Students will be able to choose the fields for various dimensions (e.g., country, year) and identify trends and patterns in the data set.\n\n### Project 7 - Advanced Data Storytelling course final project\nIn this project, students will create an animated data story and add an audio track to create a narrated finished product that they can add to their portfolio. \n\n### Project 8 - Capstone project\nBy now, you've completed several guided projects, and now's your chance to show off your skills and creativity. You'll receive a review of your project with feedback from a Udacity mentor, and they will focus on how your project demonstrates the skills you've learned. This project is designed to prepare you for delivering a polished, end-to-end solution report of a real-world problem in a field of interest.\n\nWe're excited to see what you build!",
              "instructor_notes": ""
            }
          ]
        },
        {
          "id": 848057,
          "key": "903031a1-4969-4f21-8518-52a3d6c892f2",
          "title": "Pre-requisites",
          "semantic_type": "Concept",
          "is_public": true,
          "user_state": {
            "node_key": "903031a1-4969-4f21-8518-52a3d6c892f2",
            "completed_at": null,
            "last_viewed_at": null,
            "unstructured": null
          },
          "resources": null,
          "atoms": [
            {
              "id": 848066,
              "key": "4091ae9b-b45a-46bf-9805-1257fd63d95c",
              "title": null,
              "semantic_type": "TextAtom",
              "is_public": true,
              "text": "# Before you begin...\n\n### Prerequisite Skills\nTo be successful in this program, you should have at least basic data analysis skills. See more details.\n\nThis program is appropriate for both students with a data analytics background and students with business backgrounds. You should have at least basic skills in data analysis including spreadsheets and descriptive statistics including: \n* Measures of center (mean, median, and mode) \n* Measures of spread (variance and standard deviation) \n* Distributions (normal distribution, skewness) \n* Analyzing data in spreadsheets like Microsoft Excel or Google Sheets\n\n\n### Additional Resources\nIf there are skills you'd like to brush up on, you can find the following free course in our catalog: \n* Intro to Descriptive Statistics",
              "instructor_notes": ""
            }
          ]
        }
      ]
    }
  }
}